Revit 2027 API
GeometryInstance.GetInstanceGeometry Method
Overload List
Name | Description
GetInstanceGeometry() | Computes the geometric representation of the instance.
GetInstanceGeometry(Transform) | Computes a transformation of the geometric representation of the instance.
Top
See Also
Reference
GeometryInstance Class
Autodesk.Revit.DB Namespace